: Advent of Code 2022
#+SUBTITLE: Day 01

[[file:README.org][< Main]]

* Part 1
#+NAME: PART1
#+begin_src emacs-lisp :var guide=encrypted-strategy-guide
(defun aoc222/normalize-me (gesture)
  ""
  (cond ((string= "X" gesture) "A")
        ((string= "Y" gesture) "B")
        ((string= "Z" gesture) "C")
        (t nil)))

(defun aoc222/points-for-gesture (gesture)
  "return points for given gesture. returns nil on invalid gesture"
  (cond
   ((string= "A" gesture) 1)
   ((string= "B" gesture) 2)
   ((string= "C" gesture) 3)
   (t nil)))

(defun aoc222/match-result (a b)
  "determine who will be the winner. result will be -1 if opponent wins, 0 on draw and 1 if we win"
  (cond ((string= a b) 0) ; draw
        ((or (and (string= a "A")
                  (string= b "B"))
             (and (string= a "B")
                  (string= b "C"))
             (and (string= a "C")
                  (string= b "A"))) 1) ;win
        (t -1) ; none of the above, so lose))
        ))

(defun aoc222/points-for-match-result (result)
  "returns the appropriate amount of points for given match result"
  (cond ((= -1 result) 0)
        ((= 0 result) 3)
        ((= 1 result) 6)))

(let ((results '())
      (points 0))
  (while guide
    (progn 
      (let ((match (car guide)))
        (let ((gesture-a (car match))
              (gesture-b (aoc222/normalize-me (car (cdr match)))))
          (setq points (+ points
                          (aoc222/points-for-gesture gesture-b)
                          (aoc222/points-for-match-result (aoc222/match-result gesture-a
                                                                               gesture-b))))
          (setq guide (cdr guide))))))
  points)
#+end_src

#+RESULTS: library
: 9177


* PART2
#+NAME: PART1
#+begin_src emacs-lisp :var guide=encrypted-strategy-guide
(defun aoc222/normalize-me (gesture)
  ""
  (cond ((string= "X" gesture) "A")
        ((string= "Y" gesture) "B")
        ((string= "Z" gesture) "C")
        (t nil)))

(defun aoc222/points-for-gesture (gesture)
  "return points for given gesture. returns nil on invalid gesture"
  (cond
   ((string= "A" gesture) 1)
   ((string= "B" gesture) 2)
   ((string= "C" gesture) 3)
   (t nil)))

(defun aoc222/gesture-to-get-match-result (gesture-a match-result)
  (cond ((= match-result 0) gesture-a) ; draw, return input
        ((= match-result 1) (cond ((string= gesture-a "A") "B")
                                  ((string= gesture-a "B") "C")
                                  ((string= gesture-a "C") "A")))
        
        ((= match-result -1) (cond ((string= gesture-a "A") "C")
                                   ((string= gesture-a "B") "A")
                                   ((string= gesture-a "C") "B")))))

(defun aoc222/points-for-match-result (result)
  "returns the appropriate amount of points for given match result"
  (cond ((= -1 result) 0)
        ((= 0 result) 3)
        ((= 1 result) 6)))

(let ((results '())
      (points 0))
  (while guide
    (progn 
      (let ((match (car guide)))
        (let ((gesture-a (car match))
              (match-result (car (cdr match))))
          (let ((gesture-b (aoc222/gesture-to-get-match-result
                            gesture-a
                            (cond ((string= match-result "X") -1)
                                  ((string= match-result "Y") 0)
                                  ((string= match-result "Z") 1)))))
        
          (setq points (+ points
                          (aoc222/points-for-gesture gesture-b)
                          (aoc222/points-for-match-result (aoc222/match-result gesture-a
                                                                               gesture-b))))
          (setq guide (cdr guide)))))))
  points)
#+end_src

#+RESULTS: PART1
: 12111

